# Exercise 4.9 - Part 1

## Importing Libraries and Dataset

In [34]:
# Importing libraries

import pandas as pd
import numpy as np
import os

In [35]:
# Updating the path to include more of the folder path to make our later code cleaner
path = r"C:\Users\jphar\Instacart Basket Analysis 09-2025"

In [36]:
df_cust = pd.read_csv(os.path.join(path, "02 Data", "Original Data", "customers.csv"), index_col = False)

## Summary Statistics and Data Feel

In [37]:
# Figuring out some summary statistics and data about the dataset to get a sense of the data before completing any manipulations

df_cust.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [38]:
df_cust

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [39]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [40]:
# Check for any anomolies and getting a sense of the values in the dataframe

df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [41]:
df_cust.shape

(206209, 10)

In [42]:
# I'm also creating a subset as I work with df_cust to test things before I implement it into df_cust to ensure it works properly
# However, for space and readability I may not show every step of df_test throughout the workbook but it is often being used first 
# before implementing into df_cust

df_test = df_cust[:100000]

In [43]:
df_test.shape

(100000, 10)

In [44]:
df_test

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
99995,58336,Todd,Evans,Male,Tennessee,55,7/29/2018,2,married,56673
99996,158186,Gregory,Cain,Male,Michigan,68,7/29/2018,1,married,41539
99997,1633,NaN,Gould,Male,Alabama,31,7/29/2018,2,married,93196
99998,1492,Harold,Jimenez,Male,Idaho,74,7/29/2018,1,married,110016
99999,2406,Pamela,Lara,Female,District of Columbia,47,7/29/2018,2,married,116443

## Data Wrangling

In [45]:
# Most of the headers for fields do not follow typical naming structure, contain typos, or are unclear so we'll do some renaming first

df_cust.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' :'gender', 'STATE' : 'state', 'Age': 'age',
                          'n_dependants' : 'num_of_dependents', 'fam_status' : 'martial_status'}
                          , inplace = True)

In [46]:
df_cust.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'num_of_dependents', 'martial_status', 'income'],
      dtype='object')

In [47]:
# Next, we'll drop the fields first_name and last_name since this is personally identifiable information (PII)
# so it's best remove this information from the dataframe for privacy concerns

df_cust = df_cust.drop(columns = ['first_name', 'last_name'])

In [48]:
df_cust.shape

(206209, 8)

## Data Integrity and Consistency Checks

### Null Check

In [49]:
# Based on our code here, there are no null values associated with any of the fields

df_cust.isnull().sum()

user_id              0
gender               0
state                0
age                  0
date_joined          0
num_of_dependents    0
martial_status       0
income               0
dtype: int64

### Duplicate Checking

In [50]:
# We'll set up a subset to see if duplicates are present in the dataframe

df_dups = df_cust[df_cust.duplicated()]

In [51]:
# Our result shows that there are no exact match duplicates so can can proceed with cleaning

df_dups

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, num_of_dependents, martial_status, income]
Index: []

### Checking for Mixed Types

In [52]:
# Despite the warnings, this shows us no mixed-type data fields are present

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 9:
        print(col)

C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\jphar\AppData\Local\Temp\ipykernel_3464\3586640899.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)

## Merging Into `ords_prods_merge`

In [53]:
# First we'll need to load the most recent version of ords_prods_merge

ords_prods_merge = pd.read_pickle(os.path.join(path, "02 Data", "Prepared Data", "ords_prods_merge_aggregate.pkl"))

In [54]:
ords_prods_merge.shape

(32404859, 25)

In [55]:
# Assessing the keys to include to join the two dataframes on

ords_prods_merge.columns

Index(['order_id', 'user_id', 'order_number', 'orders_day_of_week',
       'hour_ordered_of_day', 'days_since_prior_order', 'first_time_order',
       'product_id', 'add_to_cart_order', 'reordered', '_merge',
       'product_name', 'aisle_id', 'department_id', 'prices', 'price_category',
       'busiest_day', 'busiest_days', 'busiest_period_of_day', 'max_order',
       'loyalty_flag', 'avg_order_price', 'spender_type', 'median_days_prior',
       'order_frequency'],
      dtype='object')

In [56]:
df_cust.columns

Index(['user_id', 'gender', 'state', 'age', 'date_joined', 'num_of_dependents',
       'martial_status', 'income'],
      dtype='object')

In [57]:
ords_prods_cust_merge = ords_prods_merge.merge(df_cust, on = ['user_id'])

In [58]:
# Doing some quick checks to see if the merge was successful - the observations shouldn't change but rather the total fields should increase by 7
# (8 - 1 where 1 is the user_id field that is already included in ords_prods_merge)

ords_prods_cust_merge.shape

(32404859, 32)

In [59]:
ords_prods_cust_merge['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

## Exporting Dataset as Pickle File

In [60]:
ords_prods_cust_merge.to_pickle(os.path.join(path, "02 Data", "Prepared Data", "ords_prods_cust_merge.pkl"))